app/Controllers/Admin.php

SELECT *
FROM `tabel_pengaturan_sistem`
 LIMIT 1
SELECT *
FROM `kontak`
WHERE `is_read` = 0
ORDER BY `created_at` DESC
---
public function pengaturanSistem()
{
    $userId = session()->get('user_id');
    $user   = $this->adminModel->find($userId);

    if (!$user) {
        return redirect()->back()->with('error', 'User tidak ditemukan.');
    }

    // Ambil pengaturan sistem (anggap hanya 1 row)
    $pengaturanModel = new \App\Models\PengaturanSistemModel();
    $pengaturan      = $pengaturanModel->first();
    $kontakModel = new KontakModel();

        $kontak = $kontakModel
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->findAll();

SELECT *
FROM `tabel_pengaturan_sistem`
 LIMIT 1
---
public function proses_PengaturanSistem()
{
    $post = $this->request->getPost();
    $fileLogo = $this->request->getFile('logo');

    $model = new \App\Models\PengaturanSistemModel();

    // Ambil data setting pertama (anggap hanya ada 1 row)
    $setting = $model->first();