app/Controllers/Admin.php


        $kontakModel = new KontakModel();

        $kontak = $kontakModel
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `kontak`
WHERE `is_read` = 0
ORDER BY `created_at` DESC

public function listPengguna()
{
    $db = db_connect();

    // Ambil semua pengguna beserta nama peran dari tabel_peran
    $users = $db->table('tabel_pengguna')
                ->select('tabel_pengguna.*, tabel_peran.nama_peran')
                ->join('tabel_peran', 'tabel_peran.id = tabel_pengguna.peran', 'left')
                ->get()
                ->getResultArray();

    // Ambil semua peran (untuk select dropdown)
    $peranList = $db->table('tabel_peran')->get()->getResultArray();

    // Ambil pengguna pertama untuk info header
    $admin = $users[0] ?? null;
    $username = $admin['username'] ?? 'Admin';
    $email    = $admin['email'] ?? '-';
    $peran    = $admin['nama_peran'] ?? '-'; // ambil nama peran dari join

    $kontakModel = new KontakModel();

    $kontak = $kontakModel
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `tabel_pengguna`
 LIMIT 1
SELECT *
FROM `kontak`
WHERE `is_read` = 0
ORDER BY `created_at` DESC

    public function statusKasus()
{
    $perkaraModel = new \App\Models\PerkaraModel();
    $adminModel   = new \App\Models\AdminModel();

    // Ambil semua data perkara beserta nama pengacara & nama klien
    $perkara = $perkaraModel
        ->select('
            tabel_perkara.id,
            tabel_perkara.nomor_perkara,
            tabel_perkara.judul,
            tabel_perkara.tanggal_mulai,
            tabel_perkara.tanggal_selesai,
            tabel_status_perkara.nama_status as nama_status,
            tabel_pengacara.nama as nama_pengacara,
            tabel_klien.nama as nama_klien
        ')
        ->join('tabel_pengacara', 'tabel_pengacara.id = tabel_perkara.id_pengacara', 'left')
        ->join('tabel_status_perkara', 'tabel_status_perkara.id = tabel_perkara.status', 'left')
        ->join('tabel_klien', 'tabel_klien.id = tabel_perkara.id_klien', 'left')
        ->orderBy('tabel_perkara.id', 'ASC')
        ->findAll();
---
SELECT `tabel_perkara`.`id`, `tabel_perkara`.`nomor_perkara`, `tabel_perkara`.`judul`, `tabel_perkara`.`tanggal_mulai`, `tabel_perkara`.`tanggal_selesai`, `tabel_status_perkara`.`nama_status` as `nama_status`, `tabel_pengacara`.`nama` as `nama_pengacara`, `tabel_klien`.`nama` as `nama_klien`
FROM `tabel_perkara`
LEFT JOIN `tabel_pengacara` ON `tabel_pengacara`.`id` = `tabel_perkara`.`id_pengacara`
LEFT JOIN `tabel_status_perkara` ON `tabel_status_perkara`.`id` = `tabel_perkara`.`status`
LEFT JOIN `tabel_klien` ON `tabel_klien`.`id` = `tabel_perkara`.`id_klien`
ORDER BY `tabel_perkara`.`id` ASC


    $kontakModel = new KontakModel();

        $kontak = $kontakModel
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `kontak`
WHERE `is_read` = 0
ORDER BY `created_at` DESC

public function account()
{
    $adminModel = new \App\Models\AdminModel();
    $kontakModel = new \App\Models\KontakModel();

    // Ambil ID user dari session
    $id = session()->get('user_id');
    if (!$id) {
        return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
    }

    // Ambil data user dari tabel_pengguna sesuai ID login
    $user = $adminModel->find($id);
    if (!$user) {
        return redirect()->back()->with('error', 'Data user tidak ditemukan.');
    }

    // Siapkan variabel untuk view
    $username = $user['username'];
    $email    = $user['email'];
    $peran    = $user['peran'];

    // Ambil kontak unread untuk header/nav
    $kontak = $kontakModel
        ->where('is_read', 0)
        ->orderBy('created_at', 'DESC')
        ->findAll();
---
SELECT *
FROM `kontak`
WHERE `is_read` = 0
ORDER BY `created_at` DESC

public function barcodeQr()
{
    // Load model
    $adminModel = new \App\Models\AdminModel();
    $kontakModel = new \App\Models\KontakModel();
    $tabelBarcodeModel = new \App\Models\TabelBarcodeModel();
    $tabelPengacaraModel = new \App\Models\PengacaraModel();

    // Ambil ID user dari session
    $id = session()->get('user_id');
    if (!$id) {
        return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
    }

    // Ambil data user
    $user = $adminModel->find($id);
    if (!$user) {
        return redirect()->back()->with('error', 'Data user tidak ditemukan.');
    }

    // Ambil kontak unread
    $kontak = $kontakModel->where('is_read', 0)->orderBy('created_at', 'DESC')->findAll();

    $barcodeData = $tabelBarcodeModel
    ->select('tabel_barcode.*, tabel_pengacara.nama AS nama_pengacara') // Ambil nama pengacara dari tabel_pengacara
    ->join('tabel_pengacara', 'tabel_pengacara.id = tabel_barcode.nama_pengacara', 'left') // Join berdasarkan foreign key
    ->orderBy('tabel_barcode.id', 'DESC')
    ->findAll();
---
SELECT *
FROM `kontak`
WHERE `is_read` = 0
ORDER BY `created_at` DESC
SELECT `tabel_barcode`.*, `tabel_barcode`.`nama_pengacara` AS `nama`
FROM `tabel_barcode`
LEFT JOIN `tabel_pengacara` ON `tabel_pengacara`.`id` = `tabel_barcode`.`id`
ORDER BY `tabel_barcode`.`id` DESC



    // Ambil daftar pengacara untuk dropdown
    $pengacaraData = $tabelPengacaraModel->findAll();
---
SELECT *
FROM `tabel_pengacara`

public function updateBarcode($id)
{
    $model = new TabelBarcodeModel();

    // Ambil data lama dari database
    $existing = $model->find($id);
---
SELECT *
FROM `tabel_barcode`
WHERE `tabel_barcode`.`id` = '6'