app/Controllers/Admin.php

SELECT *
FROM `tabel_klien`
SELECT *
FROM `tabel_perkara`
---
public function tagihan()
{
    $tagihanModel = new \App\Models\TagihanModel();
    $klienModel   = new \App\Models\KlienModel();
    $perkaraModel = new \App\Models\PerkaraModel();
    $adminModel   = new \App\Models\AdminModel();

    // Ambil semua pengguna (untuk keperluan lain, misal list dropdown)
    $users = $adminModel->findAll();

    // Ambil pengguna pertama
    $admin = $adminModel->first();
    $username = $admin['username'] ?? 'Admin';
    $email    = $admin['email'] ?? '-';
    $peran    = $admin['peran'] ?? '-';

    // Ambil semua tagihan beserta nama klien dan nomor perkara
    $tagihan = $tagihanModel->select('
        tabel_tagihan.*,
        tabel_klien.nama AS nama_klien,
        tabel_perkara.nomor_perkara
    ')
    ->join('tabel_klien', 'tabel_klien.id = tabel_tagihan.id_klien', 'left')
    ->join('tabel_perkara', 'tabel_perkara.id = tabel_tagihan.id_perkara', 'left')
    ->orderBy('tanggal_terbit', 'DESC')
    ->findAll();

    // Ambil semua klien dan perkara untuk dropdown modal
    $klien   = $klienModel->findAll();
    $perkara = $perkaraModel->findAll();

SELECT SUM(`jumlah`) AS `jumlah`
FROM `tabel_pengeluaran_uang`
 LIMIT 1
SELECT `tabel_pengeluaran_uang`.*, SUM(tabel_pembayaran.jumlah) as total_bayar
FROM `tabel_pengeluaran_uang`
LEFT JOIN `tabel_pembayaran` ON `tabel_pembayaran`.`jumlah` = `tabel_pengeluaran_uang`.`id`
GROUP BY `tabel_pengeluaran_uang`.`id`
---
public function pembayaran()
{
    $model = new \App\Models\PembayaranModel();
    $adminModel = new \App\Models\AdminModel();
    $tagihanModel = new \App\Models\TagihanModel();
    $pengeluaranModel = new \App\Models\PengeluaranUangModel();
    $pembayaranModel = new \App\Models\PembayaranModel();

    // Hitung total pemasukan
    $totalPemasukanData = $pembayaranModel->selectSum('jumlah')->first();
    $totalPemasukan = $totalPemasukanData['jumlah'] ?? 0;

    // Hitung total pengeluaran
    $totalPengeluaranData = $pengeluaranModel->selectSum('jumlah')->first();
    $totalPengeluaran = $totalPengeluaranData['jumlah'] ?? 0;

    // Sisa uang = total pemasukan - total pengeluaran
    $sisaUang = $totalPemasukan - $totalPengeluaran;

    // Ambil semua data pengeluaran beserta total pembayaran per pengeluaran
    $listPengeluaran = $pengeluaranModel
        ->select('tabel_pengeluaran_uang.*, SUM(tabel_pembayaran.jumlah) as total_bayar')
        ->join('tabel_pembayaran', 'tabel_pembayaran.jumlah = tabel_pengeluaran_uang.id', 'left')
        ->groupBy('tabel_pengeluaran_uang.id')
        ->findAll();

SELECT `tabel_pembayaran`.*, `tabel_pembayaran`.`bukti_transfer` as `bukti_transaksi`, `tabel_tagihan`.`id_perkara`, `tabel_tagihan`.`jumlah` AS `total_tagihan`, `tabel_tagihan`.`deskripsi`, `tabel_perkara`.`nomor_perkara`, `tabel_klien`.`nama` AS `nama_klien`
FROM `tabel_pembayaran`
LEFT JOIN `tabel_tagihan` ON `tabel_tagihan`.`id` = `tabel_pembayaran`.`id_tagihan`
LEFT JOIN `tabel_perkara` ON `tabel_perkara`.`id` = `tabel_tagihan`.`id_perkara`
LEFT JOIN `tabel_klien` ON `tabel_klien`.`id` = `tabel_tagihan`.`id_klien`
ORDER BY `tabel_pembayaran`.`tanggal_pembayaran` DESC
SELECT `tabel_tagihan`.*, `tabel_klien`.`nama`
FROM `tabel_tagihan`
LEFT JOIN `tabel_klien` ON `tabel_klien`.`id` = `tabel_tagihan`.`id_klien`
---
    $peran    = $admin['peran'] ?? '-';

    // Ambil data pembayaran dengan join tabel_tagihan, tabel_perkara, tabel_klien
    $pembayaran = $model->select('
        tabel_pembayaran.*,
        tabel_pembayaran.bukti_transfer as bukti_transaksi,
        tabel_tagihan.id_perkara,
        tabel_tagihan.jumlah AS total_tagihan,
        tabel_tagihan.deskripsi,
        tabel_perkara.nomor_perkara,
        tabel_klien.nama AS nama_klien
    ')
    ->join('tabel_tagihan', 'tabel_tagihan.id = tabel_pembayaran.id_tagihan', 'left')
    ->join('tabel_perkara', 'tabel_perkara.id = tabel_tagihan.id_perkara', 'left')
    ->join('tabel_klien', 'tabel_klien.id = tabel_tagihan.id_klien', 'left')
    ->orderBy('tabel_pembayaran.tanggal_pembayaran', 'DESC')
    ->findAll();

    // Ambil semua tagihan untuk dropdown modal
    $tagihan = $tagihanModel->select('tabel_tagihan.*, tabel_klien.nama')
                ->join('tabel_klien', 'tabel_klien.id = tabel_tagihan.id_klien', 'left')
                ->findAll();