app/Controllers/Home.php

    public function index(): string
    {
        // Ambil pengaturan sistem (baris pertama)
        $pengaturan = (new PengaturanSistemModel())->first() ?? [];
---
SELECT *
FROM `tabel_pengaturan_sistem`
 LIMIT 1