app/Controllers/Pengacara.php

SELECT `tabel_jadwal_pertemuan`.*, `tabel_klien`.`nama` AS `nama_klien`, `tabel_pengacara`.`nama` AS `nama_pengacara`
FROM `tabel_jadwal_pertemuan`
LEFT JOIN `tabel_klien` ON `tabel_klien`.`id` = `tabel_jadwal_pertemuan`.`id_klien`
LEFT JOIN `tabel_pengacara` ON `tabel_pengacara`.`id` = `tabel_jadwal_pertemuan`.`id_pengguna`
WHERE `tabel_jadwal_pertemuan`.`id_pengguna` IS NULL
ORDER BY `tanggal_waktu` ASC
SELECT *
FROM `tabel_klien`
WHERE `id_pengacara` IS NULL
SELECT *
FROM `tabel_pengacara`
---
   public function jadwalpertemuan()
{
    $jadwalModelPertemuan = new JadwalPertemuanModel();
    $klienModel  = new KlienModel();
    $pengacaraModel = new PengacaraModel();


    // Ambil data jadwal pertemuan
    $jadwal = $jadwalModelPertemuan
    ->select('
        tabel_jadwal_pertemuan.*,
        tabel_klien.nama AS nama_klien,
        tabel_pengacara.nama AS nama_pengacara
    ')
    ->join('tabel_klien', 'tabel_klien.id = tabel_jadwal_pertemuan.id_klien', 'left')
    ->join('tabel_pengacara', 'tabel_pengacara.id = tabel_jadwal_pertemuan.id_pengguna', 'left')
    ->orderBy('tanggal_waktu', 'ASC')
    ->findAll();


    // Siapkan data yang dikirim ke view
    $data = [
        'jadwal'    => $jadwal,
        'klien'     => $klienModel->where('id_pengacara', $this->id_pengacara)->findAll(),
        'pengacara' => [$this->id_pengacara],
        'username'  => $this->username,
        'email'     => $this->email,
        'peran'     => $this->peran,
        'pengacara' => $pengacaraModel->findAll(),
    ];